local ls = require("luasnip")
local s = ls.snippet
local t = ls.text_node
local i = ls.insert_node

return {
  -- cb 展开为代码块
  s("cb", {
    t("```"),
    i(1, "language"),  -- 第一个占位符，默认为 "language"
    t({"", "```"}),    -- 换行并闭合代码块
    i(0)               -- 最终光标位置
  }),

  -- 标题片段
  s("h1", {
    t("# "),
    i(1, "标题"),
    i(0)
  }),

  s("h", {
    t("# "),
    i(1, "标题"),
    i(0)
  }),

  s("h2", {
    t("## "),
    i(1, "标题"),
    i(0)
  }),

  s("hh", {
    t("## "),
    i(1, "标题"),
    i(0)
  }),

  s("h3", {
    t("### "),
    i(1, "标题"),
    i(0)
  }),

  s("hhh", {
    t("### "),
    i(1, "标题"),
    i(0)
  }),

  s("h4", {
    t("#### "),
    i(1, "标题"),
    i(0)
  }),

  s("hhhh", {
    t("#### "),
    i(1, "标题"),
    i(0)
  }),

  s("h5", {
    t("##### "),
    i(1, "标题"),
    i(0)
  }),

  s("hhhhh", {
    t("##### "),
    i(1, "标题"),
    i(0)
  }),

  s("h6", {
    t("###### "),
    i(1, "标题"),
    i(0)
  }),

  s("hhhhhh", {
    t("###### "),
    i(1, "标题"),
    i(0)
  }),
}
