{
  "DrawIt": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "auto-pairs": { "branch": "master" },
  "claudecode.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "snacks.nvim": { "branch": "main" },
  "tagbar": { "branch": "master" },
  "vim-gutentags": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-table-mode": { "branch": "master" }
}
